#include <bits/stdc++.h>
using namespace std;
 
int main() {
  // main関数内に実行したい内容を記載
  cout << "Hello, world!" << endl;
  /*
    cout（しーあうと）：文字列の出力
    endl：改行
  */
  
  // -----------------------------------------
  int a = 10, b = 5;
  // 複数の変数を同時に宣言可能
  
  // -----------------------------------------
  
  /*
    変数aで入力を受け取る
    cin >> がキーワード
    入力値のデータ型によって、変数宣言時のデータを変える
  */
  int a;
  cin >> a;

  /*
    複数同時宣言、同時受け取りも可能
    ※ スペースか改行で区切られている前提
    input：2 3
          4
  */
  int a, b, c;
  cin >> a >> b >> c;


  // -----------------------------------------
}